IDEA Open Model
ArcSegment3D.Point Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the reference to Point3D of circular arc somewhere between start and end point.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public ReferenceElement Point { get; set; }
Public Property Point As ReferenceElement
	Get
	Set
Property Value
Type: ReferenceElement
See Also
Reference
ArcSegment3D Class
IdeaRS.OpenModel.Geometry3D Namespace